# Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:
#
# сторона_а (довжина сторони a).
# кут_а (кут між сторонами a і b).
# кут_б (суміжний з кутом кут_а).
# Необхідно реалізувати наступні вимоги:
#
# Значення сторони сторона_а повинно бути більше 0.
# Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
# Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення кут_б обчислюється автоматично.
# Для встановлення значень атрибутів використовуйте метод __setattr__.

class Diamant:
    def __init__(self, a_side, angle_a):
        if a_side > 0:
            self.a_side = a_side
        else:
            print("The Diamant side should be greater then 0!")

        if 0 < angle_a < 180:
            self.angle_a = angle_a
            self.angle_b = 180 - angle_a
        else:
            print("Angle should be in 0-180 range!")


d1 = Diamant(2, 20)
print(d1.a_side)
print(d1.angle_b)
print(d1.angle_b)