
# Оберіть від 3 до 5 різних домашніх завдань
# перетворюєте їх у функції (якщо це потрібно)
# створіть в папці файл homeworks.py куди вставте ваші функції з дз
# та покрийте їх не менш ніж 10 тестами (це загальна к-сть на все ДЗ).
# імпорт та самі тести помістіть в окремому файлі - test_homeworks08.py
# На оцінку впливає як якість тестів так і розмір тестового покриття. Мінімум на 10 балів - 1 правильно задизайнений позитивний тест на функцію.

import string
# task 1
"""  Написати функцію, яка обчислює суму двох чисел.
"""
def numbers_sum(a, b):
    return a + b

# numbers_sum()

# task 2
"""  Написати функцію, яка розрахує середнє арифметичне списку чисел.
"""
def avg_func(numbers):
    avg = sum(numbers) / len(numbers)
    return avg

# task 3
"""  Написати функцію, яка приймає рядок та повертає його у зворотному порядку.
"""
def reverse_string(text):
    if not text.strip():
        raise ValueError("Only string is allowed.")
    return text[::-1]

# task 4
"""  Написати функцію, яка приймає список слів та повертає найдовше слово у списку.
"""
def longest_word(text):
    words = [i.strip(string.punctuation) for i in text.split()]
    return max(words, key = len)

# task 5
"""  Написати функцію, яка приймає два рядки та повертає індекс першого входження другого рядка
у перший рядок, якщо другий рядок є підрядком першого рядка, та -1, якщо другий рядок
не є підрядком першого рядка."""
def find_substring(str1, str2):
    return str1.find(str2)
